beaker/results/beaker-d.txt
[OVERALL], RunTime(ms), 4395
[OVERALL], Throughput(ops/sec), 227.53128555176337
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 17
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.38680318543799774
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 21
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.477815699658703
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 38
[TOTAL_GC_TIME_%], Time(%), 0.8646188850967008
[READ], Operations, 0
[READ], AverageLatency(us), NaN
[READ], MinLatency(us), 9223372036854775807
[READ], MaxLatency(us), 0
[READ], 95thPercentileLatency(us), 0
[READ], 99thPercentileLatency(us), 0
[READ], Return=ERROR, 952
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 332672.0
[CLEANUP], MinLatency(us), 332544
[CLEANUP], MaxLatency(us), 332799
[CLEANUP], 95thPercentileLatency(us), 332799
[CLEANUP], 99thPercentileLatency(us), 332799
[CLEANUP], 332799, 1.0
[READ-FAILED], Operations, 952
[READ-FAILED], AverageLatency(us), 2733.121848739496
[READ-FAILED], MinLatency(us), 79
[READ-FAILED], MaxLatency(us), 1307647
[READ-FAILED], 95thPercentileLatency(us), 411
[READ-FAILED], 99thPercentileLatency(us), 1079
[READ-FAILED], 79, 1.0
[READ-FAILED], 80, 4.0
[READ-FAILED], 81, 3.0
[READ-FAILED], 82, 3.0
[READ-FAILED], 83, 1.0
[READ-FAILED], 84, 2.0
[READ-FAILED], 85, 2.0
[READ-FAILED], 87, 1.0
[READ-FAILED], 90, 3.0
[READ-FAILED], 91, 1.0
[READ-FAILED], 92, 1.0
[READ-FAILED], 94, 5.0
[READ-FAILED], 95, 5.0
[READ-FAILED], 96, 2.0
[READ-FAILED], 97, 6.0
[READ-FAILED], 98, 3.0
[READ-FAILED], 99, 3.0
[READ-FAILED], 100, 5.0
[READ-FAILED], 101, 8.0
[READ-FAILED], 103, 6.0
[READ-FAILED], 104, 6.0
[READ-FAILED], 105, 1.0
[READ-FAILED], 106, 3.0
[READ-FAILED], 107, 3.0
[READ-FAILED], 108, 3.0
[READ-FAILED], 109, 4.0
[READ-FAILED], 110, 4.0
[READ-FAILED], 111, 11.0
[READ-FAILED], 112, 3.0
[READ-FAILED], 113, 8.0
[READ-FAILED], 114, 15.0
[READ-FAILED], 115, 13.0
[READ-FAILED], 116, 4.0
[READ-FAILED], 117, 7.0
[READ-FAILED], 118, 5.0
[READ-FAILED], 119, 6.0
[READ-FAILED], 120, 5.0
[READ-FAILED], 121, 6.0
[READ-FAILED], 122, 4.0
[READ-FAILED], 123, 7.0
[READ-FAILED], 124, 3.0
[READ-FAILED], 125, 6.0
[READ-FAILED], 126, 5.0
[READ-FAILED], 127, 13.0
[READ-FAILED], 128, 6.0
[READ-FAILED], 129, 7.0
[READ-FAILED], 130, 7.0
[READ-FAILED], 131, 4.0
[READ-FAILED], 132, 6.0
[READ-FAILED], 133, 11.0
[READ-FAILED], 134, 8.0
[READ-FAILED], 135, 5.0
[READ-FAILED], 136, 9.0
[READ-FAILED], 137, 5.0
[READ-FAILED], 138, 8.0
[READ-FAILED], 139, 7.0
[READ-FAILED], 140, 7.0
[READ-FAILED], 141, 5.0
[READ-FAILED], 142, 7.0
[READ-FAILED], 143, 6.0
[READ-FAILED], 144, 5.0
[READ-FAILED], 145, 5.0
[READ-FAILED], 146, 6.0
[READ-FAILED], 147, 6.0
[READ-FAILED], 148, 3.0
[READ-FAILED], 149, 1.0
[READ-FAILED], 150, 7.0
[READ-FAILED], 151, 5.0
[READ-FAILED], 152, 6.0
[READ-FAILED], 153, 5.0
[READ-FAILED], 154, 9.0
[READ-FAILED], 155, 7.0
[READ-FAILED], 156, 8.0
[READ-FAILED], 157, 8.0
[READ-FAILED], 158, 7.0
[READ-FAILED], 159, 7.0
[READ-FAILED], 160, 2.0
[READ-FAILED], 161, 7.0
[READ-FAILED], 162, 3.0
[READ-FAILED], 163, 7.0
[READ-FAILED], 164, 6.0
[READ-FAILED], 165, 3.0
[READ-FAILED], 166, 4.0
[READ-FAILED], 167, 4.0
[READ-FAILED], 168, 6.0
[READ-FAILED], 169, 7.0
[READ-FAILED], 170, 6.0
[READ-FAILED], 171, 2.0
[READ-FAILED], 172, 10.0
[READ-FAILED], 173, 5.0
[READ-FAILED], 174, 5.0
[READ-FAILED], 175, 4.0
[READ-FAILED], 176, 6.0
[READ-FAILED], 177, 3.0
[READ-FAILED], 178, 3.0
[READ-FAILED], 179, 8.0
[READ-FAILED], 180, 6.0
[READ-FAILED], 181, 6.0
[READ-FAILED], 182, 7.0
[READ-FAILED], 183, 8.0
[READ-FAILED], 184, 7.0
[READ-FAILED], 185, 3.0
[READ-FAILED], 186, 4.0
[READ-FAILED], 187, 7.0
[READ-FAILED], 188, 3.0
[READ-FAILED], 189, 3.0
[READ-FAILED], 190, 4.0
[READ-FAILED], 191, 3.0
[READ-FAILED], 192, 4.0
[READ-FAILED], 193, 3.0
[READ-FAILED], 194, 7.0
[READ-FAILED], 195, 8.0
[READ-FAILED], 196, 2.0
[READ-FAILED], 197, 1.0
[READ-FAILED], 198, 7.0
[READ-FAILED], 199, 7.0
[READ-FAILED], 200, 4.0
[READ-FAILED], 201, 2.0
[READ-FAILED], 202, 7.0
[READ-FAILED], 203, 8.0
[READ-FAILED], 204, 5.0
[READ-FAILED], 206, 1.0
[READ-FAILED], 207, 4.0
[READ-FAILED], 208, 4.0
[READ-FAILED], 209, 1.0
[READ-FAILED], 210, 5.0
[READ-FAILED], 211, 5.0
[READ-FAILED], 212, 2.0
[READ-FAILED], 213, 3.0
[READ-FAILED], 214, 4.0
[READ-FAILED], 215, 2.0
[READ-FAILED], 216, 5.0
[READ-FAILED], 217, 2.0
[READ-FAILED], 218, 2.0
[READ-FAILED], 220, 3.0
[READ-FAILED], 221, 4.0
[READ-FAILED], 222, 4.0
[READ-FAILED], 223, 4.0
[READ-FAILED], 224, 6.0
[READ-FAILED], 225, 1.0
[READ-FAILED], 226, 3.0
[READ-FAILED], 227, 3.0
[READ-FAILED], 228, 1.0
[READ-FAILED], 229, 3.0
[READ-FAILED], 230, 2.0
[READ-FAILED], 231, 4.0
[READ-FAILED], 232, 3.0
[READ-FAILED], 234, 2.0
[READ-FAILED], 235, 7.0
[READ-FAILED], 237, 2.0
[READ-FAILED], 238, 2.0
[READ-FAILED], 239, 6.0
[READ-FAILED], 240, 1.0
[READ-FAILED], 241, 3.0
[READ-FAILED], 242, 3.0
[READ-FAILED], 243, 1.0
[READ-FAILED], 244, 1.0
[READ-FAILED], 246, 2.0
[READ-FAILED], 247, 1.0
[READ-FAILED], 248, 4.0
[READ-FAILED], 249, 2.0
[READ-FAILED], 250, 1.0
[READ-FAILED], 251, 4.0
[READ-FAILED], 253, 2.0
[READ-FAILED], 254, 2.0
[READ-FAILED], 255, 2.0
[READ-FAILED], 256, 3.0
[READ-FAILED], 257, 1.0
[READ-FAILED], 258, 2.0
[READ-FAILED], 262, 2.0
[READ-FAILED], 263, 1.0
[READ-FAILED], 266, 1.0
[READ-FAILED], 267, 3.0
[READ-FAILED], 268, 2.0
[READ-FAILED], 269, 1.0
[READ-FAILED], 271, 1.0
[READ-FAILED], 272, 2.0
[READ-FAILED], 273, 1.0
[READ-FAILED], 274, 4.0
[READ-FAILED], 276, 2.0
[READ-FAILED], 278, 2.0
[READ-FAILED], 279, 1.0
[READ-FAILED], 280, 1.0
[READ-FAILED], 281, 2.0
[READ-FAILED], 282, 1.0
[READ-FAILED], 283, 1.0
[READ-FAILED], 284, 2.0
[READ-FAILED], 285, 1.0
[READ-FAILED], 287, 1.0
[READ-FAILED], 288, 2.0
[READ-FAILED], 289, 2.0
[READ-FAILED], 290, 2.0
[READ-FAILED], 292, 1.0
[READ-FAILED], 293, 3.0
[READ-FAILED], 294, 4.0
[READ-FAILED], 295, 3.0
[READ-FAILED], 296, 1.0
[READ-FAILED], 298, 3.0
[READ-FAILED], 300, 1.0
[READ-FAILED], 301, 2.0
[READ-FAILED], 302, 2.0
[READ-FAILED], 305, 1.0
[READ-FAILED], 306, 1.0
[READ-FAILED], 307, 1.0
[READ-FAILED], 309, 2.0
[READ-FAILED], 310, 1.0
[READ-FAILED], 311, 1.0
[READ-FAILED], 312, 3.0
[READ-FAILED], 313, 1.0
[READ-FAILED], 314, 2.0
[READ-FAILED], 315, 3.0
[READ-FAILED], 317, 1.0
[READ-FAILED], 318, 1.0
[READ-FAILED], 319, 2.0
[READ-FAILED], 321, 2.0
[READ-FAILED], 322, 1.0
[READ-FAILED], 323, 1.0
[READ-FAILED], 324, 1.0
[READ-FAILED], 326, 3.0
[READ-FAILED], 327, 1.0
[READ-FAILED], 328, 1.0
[READ-FAILED], 333, 2.0
[READ-FAILED], 334, 1.0
[READ-FAILED], 335, 1.0
[READ-FAILED], 338, 2.0
[READ-FAILED], 339, 1.0
[READ-FAILED], 345, 2.0
[READ-FAILED], 347, 1.0
[READ-FAILED], 348, 1.0
[READ-FAILED], 351, 1.0
[READ-FAILED], 352, 1.0
[READ-FAILED], 355, 2.0
[READ-FAILED], 356, 1.0
[READ-FAILED], 357, 1.0
[READ-FAILED], 358, 2.0
[READ-FAILED], 361, 1.0
[READ-FAILED], 362, 2.0
[READ-FAILED], 364, 1.0
[READ-FAILED], 368, 2.0
[READ-FAILED], 369, 1.0
[READ-FAILED], 371, 1.0
[READ-FAILED], 372, 1.0
[READ-FAILED], 379, 1.0
[READ-FAILED], 382, 2.0
[READ-FAILED], 383, 1.0
[READ-FAILED], 384, 1.0
[READ-FAILED], 385, 1.0
[READ-FAILED], 386, 2.0
[READ-FAILED], 388, 1.0
[READ-FAILED], 395, 1.0
[READ-FAILED], 404, 1.0
[READ-FAILED], 407, 1.0
[READ-FAILED], 411, 1.0
[READ-FAILED], 412, 1.0
[READ-FAILED], 413, 1.0
[READ-FAILED], 414, 1.0
[READ-FAILED], 417, 1.0
[READ-FAILED], 418, 2.0
[READ-FAILED], 439, 1.0
[READ-FAILED], 442, 1.0
[READ-FAILED], 451, 1.0
[READ-FAILED], 457, 1.0
[READ-FAILED], 458, 1.0
[READ-FAILED], 461, 1.0
[READ-FAILED], 468, 1.0
[READ-FAILED], 476, 1.0
[READ-FAILED], 488, 1.0
[READ-FAILED], 506, 2.0
[READ-FAILED], 512, 1.0
[READ-FAILED], 513, 1.0
[READ-FAILED], 514, 1.0
[READ-FAILED], 519, 1.0
[READ-FAILED], 521, 1.0
[READ-FAILED], 523, 1.0
[READ-FAILED], 537, 1.0
[READ-FAILED], 543, 2.0
[READ-FAILED], 571, 1.0
[READ-FAILED], 593, 1.0
[READ-FAILED], 600, 2.0
[READ-FAILED], 611, 1.0
[READ-FAILED], 617, 1.0
[READ-FAILED], 633, 1.0
[READ-FAILED], 640, 1.0
[READ-FAILED], 703, 1.0
[READ-FAILED], 754, 1.0
[READ-FAILED], 1039, 1.0
[READ-FAILED], 1079, 1.0
[READ-FAILED], 1124, 1.0
[READ-FAILED], 1127, 1.0
[READ-FAILED], 1462, 1.0
[READ-FAILED], 1548, 1.0
[READ-FAILED], 1846, 1.0
[READ-FAILED], 2687, 1.0
[READ-FAILED], 3001, 1.0
[READ-FAILED], 3879, 1.0
[READ-FAILED], 1092607, 1.0
[READ-FAILED], 1307647, 1.0
[INSERT], Operations, 48
[INSERT], AverageLatency(us), 1537.4375
[INSERT], MinLatency(us), 222
[INSERT], MaxLatency(us), 47231
[INSERT], 95thPercentileLatency(us), 1213
[INSERT], 99thPercentileLatency(us), 47231
[INSERT], Return=OK, 48
[INSERT], 222, 1.0
[INSERT], 264, 1.0
[INSERT], 283, 1.0
[INSERT], 296, 1.0
[INSERT], 316, 1.0
[INSERT], 317, 1.0
[INSERT], 340, 1.0
[INSERT], 348, 1.0
[INSERT], 352, 1.0
[INSERT], 354, 1.0
[INSERT], 373, 1.0
[INSERT], 375, 1.0
[INSERT], 378, 1.0
[INSERT], 394, 1.0
[INSERT], 405, 1.0
[INSERT], 407, 2.0
[INSERT], 422, 1.0
[INSERT], 428, 1.0
[INSERT], 431, 1.0
[INSERT], 442, 1.0
[INSERT], 453, 1.0
[INSERT], 455, 1.0
[INSERT], 456, 1.0
[INSERT], 458, 1.0
[INSERT], 459, 1.0
[INSERT], 460, 1.0
[INSERT], 464, 1.0
[INSERT], 514, 1.0
[INSERT], 522, 1.0
[INSERT], 557, 1.0
[INSERT], 559, 1.0
[INSERT], 577, 1.0
[INSERT], 628, 1.0
[INSERT], 636, 1.0
[INSERT], 638, 1.0
[INSERT], 689, 1.0
[INSERT], 763, 1.0
[INSERT], 767, 1.0
[INSERT], 824, 1.0
[INSERT], 845, 1.0
[INSERT], 894, 1.0
[INSERT], 955, 1.0
[INSERT], 1018, 1.0
[INSERT], 1160, 1.0
[INSERT], 1213, 1.0
[INSERT], 2063, 1.0
[INSERT], 47231, 1.0